FinalProj/TestMeshes/MeshTest2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       6100;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       6150;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          125;
        startFace       6200;
    }
    wedge1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          3125;
        startFace       6325;
    }
    wedge2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          3125;
        startFace       9450;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       12575;
    }
)

// ************************************************************************* //
